Revit 2027 API
BuiltInFailures.RebarFailures.SketchNonPlanarFreeForm Property
 The selected free form rebar is not planar. Sketching it will discard the current geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchNonPlanarFreeForm { get; }
Public Shared ReadOnly Property SketchNonPlanarFreeForm As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchNonPlanarFreeForm {
	FailureDefinitionId^ get ();
}
static member SketchNonPlanarFreeForm : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace